Revit 2026 API

# LightingFixture Class

---

Provides access to the Lighting Fixture in Autodesk Revit MEP.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel Autodesk.Revit.DB.ElectricalLightingFixture

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightingFixture : MEPModel
```
```vb
Public Class LightingFixture
	Inherits MEPModel
```
```cpp
public ref class LightingFixture : public MEPModel
```
```fsharp
type LightingFixture =
    class
        inherit MEPModel
    end
```

The LightingFixture type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | Retrieves the Connector Manager from this MEPModel. (Inherited from MEPModel) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from MEPModel) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAssignedElectricalSystems | Retrieves the electrical systems this electrical panel currently is assigned to. (Inherited from MEPModel) |
|  | GetElectricalSystems | Retrieves the electrical systems that are currently created using this MEPModel. (Inherited from MEPModel) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The Lighting Fixture object can only be queried in Autodesk Revit MEP.

#### Reference

Autodesk.Revit.DB.Electrical Namespace